using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

//   2. * В некой директории лежат файлы.По структуре они содержат 3 числа, разделенные
//      пробелами. Первое число - целое, обозначает действие, 1- умножение и 2- деление,
//      остальные два - числа с плавающей точкой. Написать многопоточное приложение,
//      выполняющее выполняющее вышеуказанные действия над числами и сохраняющими
//      результат в файл result.dat.Количество файлов в директории заведомо много.

namespace lesson_6_2
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
